{
  "collection": [
    {
      "id": 1,
      "artist": "Waterparks",
      "title": "Intellectual Property: Vinyl LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/61iiS9tpFQL._AC_SL1100_939bfe48-d7c7-49db-a255-6677e2005728.jpg?v=1681404511&width=1100",
      "price": 38.99,
      "inStock": 6,
      "sold": 1,
      "release": "14 April, 2023",
      "description": "Waterparks, composed of Awsten Thank Knight [vocals, guitar], Otto Wood [drums], and Geoff Wigington [guitar]— manically move forward, shucking and jiving between fits of rock, alternative, and electronic with pop ambition and hip-hop’s bold and blatant disregard for the rules.\n\nThe band announced their 5th studio album INTELLECTUAL PROPERTY on their Kerrang! Cover in November.\n\nThe Houston trio has landed the covers of Alternative Press, V Magazine, Kerrang!, Rock Sound, and more and have garnered support from Spotify, Apple Music, and Amazon Music, finding themselves on numerous New Music Fridays and countless rock/alt playlists. The band has also topped the Billboard 200 chart.\n\nWaterparks’ unique and genre-blending sound puts them in a lane all their own, melding rock, pop, hip-hop, alternative, indie, electronic, and even R&B.",
      "label": "Parlophone",
      "formats": "Vinyl LP",
      "total": 38.99
    },
    {
      "id": 2,
      "artist": "Melvins",
      "title": "The Bulls & The Bees + Electroretard: Limited Canary Yellow Vinyl 2LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/Melvins_20-_20Bulls_20Bees_20-_20IPC255LP_20-_20Standard.jpg?v=1680525835&width=3000",
      "price": 44.99,
      "inStock": 4,
      "sold": 1,
      "release": "19 May, 2023",
      "description": "The first time on vinyl for the complete collection of these two albums together in one package with special 12 page booklet included",
      "label": "Ipecac",
      "formats": "Vinyl LP",
      "total": 44.99
    },
    {
      "id": 3,
      "artist": "The Libertines",
      "title": "Up The Bracket: Vinyl LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-138645.jpg?v=1678667295&width=625",
      "price": 26.99,
      "inStock": 4,
      "sold": 1,
      "release": "1 January, 2007",
      "description": "The Libertines burst onto the scene with 'Up the Bracket', a debut album so confident and consistent that the easiest way to describe it is 2002's answer to 'Is This It'. Virtually every song on 'Up the Bracke't is chock-full of the same kind of bouncy, aggressive guitars, expressive, economic drums, and irresistible hooks that made the Strokes' debut almost too catchy for the band's credibility.",
      "label": "Rough Trade",
      "formats": "Vinyl LP",
      "total": 26.99
    },
    {
      "id": 4,
      "artist": "Through Fire",
      "title": "Devil’s Got You Dreamin’: Limited Blue Vinyl LP",
      "image": "https://cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-142742.png?v=1678668101&width=800",
      "price": 30.99,
      "inStock": 4,
      "sold": 1,
      "release": "21 April, 2023",
      "description": "Devil's Got You Dreamin' is the newest album from hard rock band, Through Fire. Coming off success from their previous releases through Sumerian Records, All Animal and their critically acclaimed album, Breathe, the Omaha-based quartet have shown consistent evolution, reshaping the hard rock sound with electronic flourishes and airtight songcraft. From songs like \"Karma Kills\", \"Lose It\", and “Devolution,” Through Fire have proven their no rules state of mind and continue to break the boundaries of music. Limited vinyl pressing includes standard jacket, full colour inner sleeve with lyrics, and digital download card.",
      "label": "Sumerian Records",
      "formats": "Vinyl LP",
      "total": 30.99
    },
    {
      "id": 5,
      "artist": "Wet Leg",
      "title": "Wet Leg: Vinyl LP",
      "image": "https://cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-104026.png?v=1678664040&width=800",
      "price": 31.99,
      "inStock": 4,
      "sold": 1,
      "release": "8 April, 2022",
      "description": "After releasing two of the hottest singles of the year, Wet Leg’s Rhian Teasdale and Hester Chambers were catapulted from their confines on the Isle of Wight to sold out venues across the UK and packed-out tents at festivals causing giddy excitement wherever they went. Now, the duo is thrilled to unveil news of their debut album. Wet Leg was recorded and produced in the main by Speedy Wunderground’s Dan Carey (“Chaise Longue” and “Angelica” were produced by Jon McMullen and Josh Mobaraki respectively). The album was mostly recorded in London, in April 2021, meaning they had a finished album before the world had even heard debut single “Chaise Longue” or played live. \"I guess how it happened was unconventional,\" admits Hester. Right from the start of Wet Leg, Teasdale and Chambers focus was fun, and a dry sense of humour ripples through the album. \"I wanted to write fun songs, I didn't want to indulge sad feelings too much, I wanted to write stuff that's fun to listen to and fun to play,” reveals Rhian. “But then, the sad seeps through, as well.\" Wet Leg is sad music for party people, and party music for sad people. It is cathartic and joyful and punk and scuzzy and above all, it's fun. \"Wet Leg was originally just supposed to be funny,\" says Rhian. \"As a woman, there's so much put on you, in that your only value is how pretty or cool you look. But we want to be goofy and a little bit rude. We want to write songs that people can dance to. And we want people to have a good time, even if that might not possible all of the time.",
      "label": "Domino",
      "formats": "Vinyl LP",
      "total": 31.99
    },
    {
      "id": 6,
      "artist": "Daft Punk",
      "title": "Discovery: Vinyl 2LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-147839.jpg?v=1678725066&width=1080",
      "price": 40.99,
      "inStock": 4,
      "sold": 1,
      "release": "17 February, 2023",
      "description": "Second studio album by the French electronic music duo. Originally released in 2001, the album marks a shift from the Chicago house sound prevalent on their first studio record, 'Homework' (1997), to a house style more heavily inspired by disco, post-disco, garage house, and R&B. The album features six singles, 'One More Time', 'Aerodynamic', 'Digital Love', 'Harder, Better, Faster, Stronger', 'Face to Face' and 'Something About Us'.",
      "label": "Warner",
      "formats": "Vinyl LP",
      "total": 40.99
    },
    {
      "id": 7,
      "artist": "Chase and Status",
      "title": "More Than A Lot: Limited Pink & Black Marbled Vinyl 2LP [NAD 2022]",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-147055_25c4fc10-95a4-4bb6-8e6e-ad7c113e2f71.png?v=1678666878&width=800",
      "price": 45.99,
      "inStock": 4,
      "sold": 1,
      "release": "27 October, 2022",
      "description": "After signing to RAM in 2007, the duo of Saul Milton & Will Kennard aka Chase & Status got working on their debut album for the label which ended up being the genre and crossover classic More Than Alot. Originally released in 2008, the album showcased not only their ability to craft amazing drum & bass, but also dubstep and even hip hop. With such anthems as Hurt You, Take Me Away, Pieces (feat. Plan B) and the club banger Smash TV. Over a decade later More Than Alot is still a firm favourite amongst fans and is pressed in full for the first time on pink and black marble vinyl.",
      "label": "BMG",
      "formats": "Vinyl LP",
      "total": 45.99
    },
    {
      "id": 8,
      "artist": "Desire Marea",
      "title": "On The Romance Of Being: Vinyl 2LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/DesireMarea_STUMM477_FULL2_1080_a5205c00-76f2-4c63-a0c5-eb4dda4771d5.jpg?v=1680525174&width=1080",
      "price": 42.99,
      "inStock": 4,
      "sold": 1,
      "release": "7 April, 2023",
      "description": "The Amandawe, South Africa-based artist Desire Marea returns with his transformative second album, On the Romance of Being.\n\nImmersed in the communal, ceremonial and healing qualities of music, this record is the next epoch from the multidisciplinary artist and follows his acclaimed solo eponymous debut. Recorded live with an ensemble of 13 musicians, On the Romance of Being consists of 8 movements that sonically sprawl across post-gospel, spiritual jazz, black classical and the ancient music of the Nguni and Ndau peoples and elicits a sincere conversation between the erotic and spiritual.",
      "label": "Mute",
      "formats": "Vinyl LP",
      "total": 42.99
    },
    {
      "id": 9,
      "artist": "Radiohead",
      "title": "Amnesiac: Vinyl LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-147818_5ccc1eab-6a13-494a-b721-c81b581d8a0d.jpg?v=1678725120&width=625",
      "price": 39.99,
      "inStock": 4,
      "sold": 1,
      "release": "17 February, 2023",
      "description": "This second helping from the sessions that produced the preceding Kid A will probably strike close listeners as a bit more structured, though it'll be difficult to determine whether that's simply because the peregrinations of the last album have prepared them for the trips to the outer limits taken here. Those expecting a U2-like return to tuneful, anthemic guitar-rock will have their hopes dashed upon a rock of colourful electronic experimentation and moody, studio-enhanced madness. The piano-based Pyramid Song and the martian-gospel-choir ballad You and Whose Army? might placate verse-chorus-verse traditionalists slightly, but the sampler-in-a-trash-compactor Pulk / Pull Revolving Doors and the pointillistic ambience of Hunting Bears attest to Radiohead's continued nonconformist tendencies. Amnesiac opens with the claustrophobic, synth-bedecked Packt Like Sardines in a Crushd Tin Box and closes with the dixieland funeral march Life in a Glass House.",
      "label": "XL Recordings",
      "formats": "Vinyl LP",
      "total": 39.99
    },
    {
      "id": 10,
      "artist": "Roger Waters (Pink Floyd)",
      "title": "Igor Stravinsky's The Soldier's Tale: Crystal Clear Vinyl LP",
      "image": "//cdn.shopify.com/s/files/1/0688/4297/9608/products/SharedImage-148151_20_1_20_1_25d8f14d-e12e-4909-a335-b17a1a9bae6a.jpg?v=1680525477&width=1200",
      "price": 48.99,
      "inStock": 4,
      "sold": 1,
      "release": "7 April, 2023",
      "description": "The original theatre work is one “to be read, played, and danced” by three actors (the soldier, the devil, and a narrator) and dancers, accompanied by a septet of instruments. The libretto relates the parable of a soldier who trades his fiddle to the devil in return for unlimited economic gain. The music is scored for a septet of violin, double bass, clarinet, bassoon, cornet or trumpet), trombone, and percussion. The libretto is adapted by Roger Waters from the translation by Michael Flanders and Kitty Black, based on the original text by Charles-Ferdinand Ramus.",
      "label": "Music On Vinyl",
      "formats": "Vinyl LP",
      "total": 48.99
    }
  ]
}
